{
  "bulletpoints": [
    {
      "ID": 1,
      "bulletpoint": "Delivered Bloodsport’s telemetry system with cinematic UI at 10Hz, showcasing cross-functional tech innovation and real-time monitoring to meet high-stakes requirements."
    },
    {
      "ID": 2,
      "bulletpoint": "Developed a Unity-based telemetry UI with sci-fi visuals, bridging engineering and audience engagement through real-time data insights and dynamic animations."
    },
    {
      "ID": 3,
      "bulletpoint": "Created a sci-fi-inspired, immersive telemetry display in Unity, using VR app development principles to enhance interactivity and audience appeal in real time."
    },
    {
      "ID": 4,
      "bulletpoint": "Designed Bloodsport’s cutting-edge telemetry system, using KiCAD and custom PCBs to withstand combat demands and ensure durability in high-speed environments."
    },
    {
      "ID": 5,
      "bulletpoint": "Engineered custom embedded telemetry electronics in C++ and KiCAD, optimizing data accuracy and latency for reliable, real-time performance monitoring."
    },
    {
      "ID": 6,
      "bulletpoint": "Delivered telemetry solutions under rigorous conditions, with robust data stability and insights—meeting the standards of defense technology environments."
    },
    {
      "ID": 7,
      "bulletpoint": "Built an intuitive telemetry UI, using web dev best practices to make real-time insights accessible for engineers and TV audiences in a high-pace setup."
    },
    {
      "ID": 8,
      "bulletpoint": "Led telemetry system design and optimization, aligning with FAANG-level quality and performance for high-impact data management in competitive settings."
    },
    {
      "ID": 9,
      "bulletpoint": "Managed a dozen PCB runs, saving 1-2 hrs per board in manual assembly and cutting costs through optimized overseas production partnerships."
    },
    {
      "ID": 10,
      "bulletpoint": "Built a Unity3D-based telemetry system with sci-fi visuals, combining data and entertainment for improved engagement in live matches and post-analysis."
    },
    {
      "ID": 11,
      "bulletpoint": "Developed data visualization best practices to deliver a telemetry interface that combines essential engineering insights with an engaging, cinematic experience."
    },
    {
      "ID": 12,
      "bulletpoint": "Applied RF protocols like LoRa to ensure Bloodsport’s data stability in RF-hostile arenas, showcasing expertise in high-resilience embedded systems for robotics."
    },
    {
      "ID": 13,
      "bulletpoint": "Self-taught microcontroller design for telemetry; created KiCAD custom boards optimized for data accuracy, balancing durability with production efficiency."
    },
    {
      "ID": 14,
      "bulletpoint": "Created a telemetry display inspired by Iron Man and The Matrix to meet BattleBots' entertainment standards, enhancing live data presentation for audiences."
    },
    {
      "ID": 15,
      "bulletpoint": "Optimized embedded telemetry systems for real-time monitoring, enhancing Bloodsport’s competitive performance and live insights during critical match moments."
    },
    {
      "ID": 16,
      "bulletpoint": "Designed safety covers to exceed standard requirements, impressing internal reviewers with robust, quality-focused solutions that emphasize durability and safety."
    },
    {
      "ID": 17,
      "bulletpoint": "Successfully delivered a fully operational telemetry system under a six-week timeline, showcasing rapid adaptability to shifting requirements and schedules."
    },
    {
      "ID": 18,
      "bulletpoint": "Built Bloodsport’s telemetry display to appeal to 4M+ TV viewers per episode, blending high-impact data insights with visual appeal in a cinematic UI."
    },
    {
      "ID": 19,
      "bulletpoint": "Developed high-performance telemetry boards for combat robotics, showcasing custom electronics expertise that optimizes data speed, reliability, and durability."
    },
    {
      "ID": 20,
      "bulletpoint": "Led the integration of embedded systems, telemetry, and UI design, creating a seamless data solution that balances technical accuracy and visual entertainment."
    },
    {
      "ID": 21,
      "bulletpoint": "Spearheaded overseas PCB manufacturing, saving 1-2 hrs per board in manual assembly and cutting costs, while maintaining high standards of performance."
    },
    {
      "ID": 22,
      "bulletpoint": "Designed telemetry electronics to withstand extreme conditions, ensuring durable, real-time insights even in the challenging environments of BattleBots matches."
    },
    {
      "ID": 23,
      "bulletpoint": "Created a telemetry display that enhanced Bloodsport’s on-screen impact, building a sci-fi-inspired UI that captures audience interest and supports engineers."
    },
    {
      "ID": 24,
      "bulletpoint": "Oversaw Bloodsport telemetry board design, using C++ to enhance data speed and accuracy, supporting real-time health monitoring in competitive robotics."
    },
    {
      "ID": 25,
      "bulletpoint": "Developed a real-time telemetry UI with animations, using Unity and web development principles to ensure accessible, engaging data presentation."
    },
    {
      "ID": 26,
      "bulletpoint": "Balanced data visualization and engineering needs in Bloodsport’s telemetry UI, producing insights in real time that appeal to engineers and audiences alike."
    },
    {
      "ID": 27,
      "bulletpoint": "Created a sci-fi-inspired telemetry UI with Unity, achieving a cinematic feel that resonates with viewers and enhances live match data visibility."
    },
    {
      "ID": 28,
      "bulletpoint": "Oversaw the logistics of producing custom PCB boards, optimizing for reduced costs and time savings while maintaining reliability and high data accuracy."
    },
    {
      "ID": 29,
      "bulletpoint": "Boosted Bloodsport’s weapon performance, improving spin-up time by 25% and torque by 60%, while safely increasing current from 200A to 300A for stronger impacts."
    },
    {
      "ID": 30,
      "bulletpoint": "Enhanced Bloodsport’s telemetry interface, ensuring stable RF transmission in hostile environments and capturing high-quality data insights for post-match review."
    }
  ]
}