{
  "bulletpoints": [
    {
      "ID": 1,
      "bulletpoint": "Built and led Grey Skies Automation, designing custom combat robots like Data Collector and Two Factor Annihilation for competitive events nationwide."
    },
    {
      "ID": 2,
      "bulletpoint": "Developed Two Factor Annihilation with Steam Deck integration for real-time telemetry and control, achieving 2nd place at debut, impressing robot combat enthusiasts."
    },
    {
      "ID": 3,
      "bulletpoint": "Created 'smart' driving electronics for semi-autonomous control, auto-adjusting based on arena conditions, enhancing performance and ease of control."
    },
    {
      "ID": 4,
      "bulletpoint": "Pioneered semi-autonomous combat robotics with advanced sensor feedback, proving viability of 'smart' controls in live events."
    },
    {
      "ID": 5,
      "bulletpoint": "Integrated real-time 3D orientation views and audio impact feedback via Steam Deck, enhancing combat robots’ performance monitoring."
    },
    {
      "ID": 6,
      "bulletpoint": "Designed custom Arduino Nano breakout board to simplify ESC reprogramming, reducing setup complexity and improving usability in the robotics community."
    },
    {
      "ID": 7,
      "bulletpoint": "Achieved efficient combat robot fabrication by managing CNC, laser-cut, and 3D-printed parts with advanced materials like carbon fiber nylon."
    },
    {
      "ID": 8,
      "bulletpoint": "Utilized expertise in materials science to craft precise robot components, balancing performance, durability, and weight requirements."
    },
    {
      "ID": 9,
      "bulletpoint": "Increased ESC reprogramming efficiency by 40% with custom breakout board, adopted by major robotics shop, generating revenue and community acclaim."
    },
    {
      "ID": 10,
      "bulletpoint": "Implemented gyroscopic force countering in combat bots, stabilizing controls during maneuvers, resulting in 25% improved handling accuracy."
    },
    {
      "ID": 11,
      "bulletpoint": "Enhanced robot reliability by integrating adaptive controls that modify based on sustained damage, keeping performance optimal mid-battle."
    },
    {
      "ID": 12,
      "bulletpoint": "Leveraged C++ and embedded systems for custom telemetry system, tracking robot speed, orientation, and motor data in real-time."
    },
    {
      "ID": 13,
      "bulletpoint": "Deployed semi-autonomous 'smart' adjustments, helping maintain control of bots despite arena damage, gaining a competitive edge."
    },
    {
      "ID": 14,
      "bulletpoint": "Built and sold affordable ESC programming kits for the robotics community, generating a steady revenue stream and increasing brand visibility."
    },
    {
      "ID": 15,
      "bulletpoint": "Developed custom firmware for combat robots, optimizing control and response time to elevate in-battle precision and effectiveness."
    },
    {
      "ID": 16,
      "bulletpoint": "Spearheaded advanced electronics and telemetry integration in robots, allowing on-the-fly adjustments and real-time feedback on motor health."
    },
    {
      "ID": 17,
      "bulletpoint": "Managed design and production for Grey Skies, sourcing high-quality laser-cut metal and CNC carbon fiber for enhanced durability."
    },
    {
      "ID": 18,
      "bulletpoint": "Enhanced combat bot control with Steam Deck as a primary interface, featuring telemetry, live adjustments, and audio feedback."
    },
    {
      "ID": 19,
      "bulletpoint": "Designed and optimized PCB layout for ESC programming, simplifying the wiring process and reducing setup time by 30%."
    },
    {
      "ID": 20,
      "bulletpoint": "Built advanced combat robots with CNC precision, achieving exact specifications with expert handling of manufacturing and assembly."
    },
    {
      "ID": 21,
      "bulletpoint": "Achieved seamless robot control through advanced C++ coding and Unity integration, adapting systems to live combat environments."
    },
    {
      "ID": 22,
      "bulletpoint": "Applied knowledge of gyroscopic procession to stabilize controls, mitigating spin-out risk by 50% during high-speed maneuvers."
    },
    {
      "ID": 23,
      "bulletpoint": "Introduced a settings lock feature for the Steam Deck control system, preventing accidental changes during intense matches."
    },
    {
      "ID": 24,
      "bulletpoint": "Established a reputation for precision-driven robotics design and build, combining electronics expertise with CNC, 3D printing, and manual milling."
    },
    {
      "ID": 25,
      "bulletpoint": "Leveraged Unity and custom firmware for real-time telemetry display, enabling instant visibility of robot orientation and impact response."
    },
    {
      "ID": 26,
      "bulletpoint": "Created fully integrated telemetry system showing 3D robot orientation and motor status, helping operators adjust in real-time."
    },
    {
      "ID": 27,
      "bulletpoint": "Delivered precise CNC, laser-cut, and 3D-printed parts for each robot, ensuring quality and durability under combat stress."
    },
    {
      "ID": 28,
      "bulletpoint": "Reduced downtime by optimizing internal control features to adjust automatically for sustained battle damage, enhancing bot resilience."
    },
    {
      "ID": 29,
      "bulletpoint": "Utilized Steam Deck power management to prevent sleep mode during matches, maintaining seamless control during critical battles."
    },
    {
      "ID": 30,
      "bulletpoint": "Successfully demonstrated unique robot features and 'smart' assistance, earning recognition and a feature interview in a major robotics channel."
    }
  ]
}