{
  "bulletpoints": [
    {
      "ID": 1,
      "bulletpoint": "Developed rhythm minigames for 'Virtual Virtual Reality 2,' designing an extensible game engine compatible with multiple VR platforms, praised for polish and depth by casual and experienced players alike."
    },
    {
      "ID": 2,
      "bulletpoint": "Created and owned game mechanics in 'Stranger Things VR,' enabling immersive interactions with characters and telekinetic powers, expanding the game’s world and appeal."
    },
    {
      "ID": 3,
      "bulletpoint": "Implemented motion controller integration for rhythm games, ensuring smooth cross-platform play on Meta Quest, SteamVR, and Meta Rift, enhancing user accessibility."
    },
    {
      "ID": 4,
      "bulletpoint": "Delivered four additional rhythm game levels on time for VVR2’s 'Music Update,' playtested rigorously, contributing to a rise in new users post-update."
    },
    {
      "ID": 5,
      "bulletpoint": "Built a scalable rhythm game engine for Tender Claws’ VR titles, structuring it for reusability and modularity across various gameplay designs, optimizing future development."
    },
    {
      "ID": 6,
      "bulletpoint": "Collaborated with artist and QA lead to release VVR2’s 'Music Update,' debugging and refining levels for a polished final product that boosted player engagement."
    },
    {
      "ID": 7,
      "bulletpoint": "Produced subtitle generation tools for multiple language support, automating verification processes and reducing errors, significantly enhancing global accessibility."
    },
    {
      "ID": 8,
      "bulletpoint": "Led chapter development in 'Stranger Things VR,' overseeing production schedules, quality assurance, and gameplay mechanics, resulting in on-time delivery without major issues."
    },
    {
      "ID": 9,
      "bulletpoint": "Adapted to urgent publisher requests, quickly resolving bugs to maintain the quality and performance standards of 'Stranger Things VR.'"
    },
    {
      "ID": 10,
      "bulletpoint": "Designed VR mechanics for 'Stranger Things VR,' enabling players to navigate dreams, memories, and possess minds, expanding the immersive experience of the game."
    },
    {
      "ID": 11,
      "bulletpoint": "Refined subtitle workflows by automating error-checking processes, reducing manual labor, and integrating tool documentation for long-term project benefits."
    },
    {
      "ID": 12,
      "bulletpoint": "Constructed complex gameplay elements for 'VVR2,' including mech piloting and avatar rescue challenges, blending humor, action, and rhythm."
    },
    {
      "ID": 13,
      "bulletpoint": "Conducted extensive playtesting for rhythm game mechanics, gathering player feedback to refine difficulty levels and ensure an engaging experience for diverse player skill levels."
    },
    {
      "ID": 14,
      "bulletpoint": "Designed and implemented subtitle tools that streamlined the localization process, enabling the team to complete multiple language versions with fewer errors."
    },
    {
      "ID": 15,
      "bulletpoint": "Integrated satirical rhythm game mechanics in VVR2, leveraging Beat Saber clone mechanics to fit the theme and engage players."
    },
    {
      "ID": 16,
      "bulletpoint": "Created modular VR gameplay components in Unity, increasing code reusability and adaptability, thus reducing development time for new projects."
    },
    {
      "ID": 17,
      "bulletpoint": "Enhanced Meta Quest compatibility by optimizing Unity scripts and assets, ensuring smooth VR experiences for users across multiple hardware setups."
    },
    {
      "ID": 18,
      "bulletpoint": "Delivered critical game updates on time under tight deadlines, demonstrating adaptability and efficiency in managing last-minute changes."
    },
    {
      "ID": 19,
      "bulletpoint": "Structured VVR2’s rhythm game engine for future scalability, allowing its seamless integration into different levels and VR environments."
    },
    {
      "ID": 20,
      "bulletpoint": "Developed interactive VR features for 'Stranger Things VR' that explored unique character perspectives, adding depth to the Stranger Things universe."
    },
    {
      "ID": 21,
      "bulletpoint": "Designed game mechanics in VVR2 to accommodate various user abilities, allowing both casual and experienced players to enjoy rhythm-based levels."
    },
    {
      "ID": 22,
      "bulletpoint": "Constructed robust Unity components for VR environments, improving stability and cross-platform performance on SteamVR and Meta Quest devices."
    },
    {
      "ID": 23,
      "bulletpoint": "Engineered modular rhythm mechanics for 'Virtual Virtual Reality 2,' ensuring compatibility across VR platforms and scalability for content updates."
    },
    {
      "ID": 24,
      "bulletpoint": "Managed end-to-end chapter production in 'Stranger Things VR,' from design to deployment, achieving milestones without production delays."
    },
    {
      "ID": 25,
      "bulletpoint": "Created tools to streamline subtitle creation and integration, reducing error rates and enhancing the localization workflow for future VR titles."
    },
    {
      "ID": 26,
      "bulletpoint": "Crafted dynamic gameplay scenarios for Stranger Things VR, including mind control mechanics and telekinesis, enriching player immersion."
    },
    {
      "ID": 27,
      "bulletpoint": "Optimized VR assets and shaders in Unity, improving rendering performance across Meta Quest platforms, creating smoother gameplay experiences."
    },
    {
      "ID": 28,
      "bulletpoint": "Spearheaded the creation of reusable gameplay systems in Unity, leading to reduced development time for similar future projects."
    },
    {
      "ID": 29,
      "bulletpoint": "Acted as lead tester for rhythm mechanics in VVR2, applying player feedback to improve playability, level flow, and user engagement."
    },
    {
      "ID": 30,
      "bulletpoint": "Resolved high-priority bugs swiftly, balancing speed with precision to meet publishing deadlines without compromising game quality."
    }
  ]
}