{
  "requiredbulletpoints": [
    {
      "ID": 1,
      "bulletpoint": "Designed custom electronics, firmware, and cinematic UI to monitor a 250 lb combat robot's health for live battles, post-match analysis, and pre-tournament debugging."
    }
  ],
  "bulletpoints": [
    {
      "ID": 1,
      "bulletpoint": "Developed a Unity-based telemetry UI with sci-fi visuals, bridging engineering and 4M+ audience engagement and showcasing cross-functional tech innovation through real-time data insights and dynamic animations."
    },
    {
      "ID": 2,
      "bulletpoint": "Designed Bloodsport’s cutting-edge telemetry electronics, using KiCAD and custom PCBs to withstand combat demands and ensure durability in high-speed environments."
    },
    {
      "ID": 3,
      "bulletpoint": "Engineered custom embedded telemetry electronics and firmware in C++ and KiCAD, optimizing data accuracy and latency for reliable, real-time performance monitoring."
    },
    {
      "ID": 4,
      "bulletpoint": "Managed manufacturing of several PCB designs, saving 1-2 hours per board in manual assembly and cutting costs through optimized overseas production partnerships."
    },
    {
      "ID": 5,
      "bulletpoint": "Applied RF protocols like LoRa to ensure Bloodsport’s data stability in RF-hostile arenas and venues, showcasing expertise in high-resilience embedded systems for robotics."
    },
    {
      "ID": 6,
      "bulletpoint": "Optimized embedded telemetry systems for real-time monitoring, enhancing Bloodsport’s competitive performance and live insights during critical match moments."
    },
    {
      "ID": 7,
      "bulletpoint": "Designed safety devices to exceed standard requirements, impressing internal reviewers with robust, quality-focused solutions that emphasize durability and safety."
    },
    {
      "ID": 8,
      "bulletpoint": "Spearheaded overseas PCB manufacturing, saving 1-2 hrs per board in manual assembly and cutting costs, while maintaining high standards of performance."
    },
    {
      "ID": 9,
      "bulletpoint": "Designed telemetry electronics to withstand extreme conditions, ensuring durable, real-time insights even in the challenging environments of BattleBots matches."
    },
    {
      "ID": 10,
      "bulletpoint": "Provided insights through Bloodsport’s telemetry system that led to a 25% improvement in spin-up time, a 60% increase in torque, and a safe current increase by 50%, resulting in stronger impacts."
    }
  ]
}