{
  "requiredbulletpoints": [
    {
      "ID": 1,
      "bulletpoint": "Excelled as a Unity generalist software engineer, crafting gameplay for Virtual Virtual Reality 2 and Stranger Things VR, released on Meta Quest, Rift, and SteamVR."
    }
  ],
  "bulletpoints": [
    {
      "ID": 1,
      "bulletpoint": "Created and owned game mechanics in 'Stranger Things VR,' enabling immersive interactions with characters and telekinetic powers, expanding the game’s narrative world and appeal."
    },
    {
      "ID": 2,
      "bulletpoint": "Implemented device-specific controls and tutorials in multiple titles, ensuring smooth cross-platform play on Meta Quest, SteamVR, and Meta Rift, enhancing user accessibility."
    },
    {
      "ID": 3,
      "bulletpoint": "Delivered four additional rhythm game levels on time for VVR2’s 'Music Update,' playtested rigorously, contributing to a rise in new users post-update."
    },
    {
      "ID": 4,
      "bulletpoint": "Built a scalable rhythm game engine for Tender Claws’ VR titles, structuring it for reusability and modularity across various gameplay designs, optimizing future development."
    },
    {
      "ID": 5,
      "bulletpoint": "Collaborated with artist and QA lead to release VVR2’s 'Music Update,' implementing, debugging, and refining levels for a polished final product that boosted player engagement."
    },
    {
      "ID": 6,
      "bulletpoint": "Produced subtitle generation tools for multiple language support, automating verification processes and reducing errors, significantly enhancing global accessibility."
    },
    {
      "ID": 7,
      "bulletpoint": "Adapted to urgent publisher requests, quickly resolving bugs to maintain the quality and performance standards of 'Stranger Things VR.'"
    },
    {
      "ID": 8,
      "bulletpoint": "Designed VR gameplay mechanics for 'Stranger Things VR,' enabling players to navigate dreams, memories, and possess minds, expanding the immersive experience of the game."
    },
    {
      "ID": 9,
      "bulletpoint": "Conducted extensive playtesting for rhythm game mechanics, gathering player feedback to refine difficulty levels and ensure an engaging experience for diverse player skill levels."
    },
    {
      "ID": 10,
      "bulletpoint": "Resolved high-priority bugs swiftly, balancing speed with precision to meet publishing deadlines without compromising game quality."
    }
  ]
}